<template>
  <div>
    <div class="text-subtitle2">«{{quotes[randQuoteIndex].quote}}»</div>
    <div class="text-caption">{{quotes[randQuoteIndex].author}}</div>
  </div>
</template>
<script>
  export default {
    name: 'QuotesRandomizer',
    data() {
      return {
        randQuoteIndex: 0,
        quotes: [
          {
            quote: 'Labor omnia vincit',
            author: 'Вергілій',
          },
          {
            quote: 'Освіта - скарб; праця - ключ до нього',
            author: 'П. Буаст',
          },
          {
            quote: 'Прокладай шлях до розуму людини через її серце',
            author: 'Ф.Честерфілд',
          },
          {
            quote: 'Найперше, що має зробити вчитель, - це розвинути в учня дух допитливості',
            author: 'Д.Менделєєв',
          },
          {
            quote: 'Навчання без міркування – даремне, міркування без навчання – небезпечне',
            author: 'Конфуцій',
          },
          {
            quote: 'Учень – це не посудина, яку потрібно наповнити, а факел, який треба запалити',
            author: 'К.Ушинський',
          },
          {
            quote: 'Мистецтво навчання є мистецтво пробуджувати в юних душах допитливість і потім задовольняти її',
            author: 'А.Франс',
          },
          {
            quote: 'Найголовніше прищепити смак і любов до науки: інакше ми виховаємо просто віслюків, ' +
              'навантажених книжною премудрістю',
            author: 'М.Монтень',
          },
          {
            quote: 'Майбутнє наших дітей, майбутнє народу – в руках учителя. В його золотому серці',
            author: 'О.Фадєєв',
          },
          {
            quote: 'Після хліба найважливіше для народу - школа',
            author: 'Ж. Дантон',
          },
          {
            quote: 'Ніколи не соромся запитувати про те, чого не знаєш',
            author: 'Арабське прислів’я',
          },
          {
            quote: 'Я знаю, що нічого не знаю',
            author: 'Сократ',
          },
          {
            quote: 'Учітеся, брати мої, думайте, читайте',
            author: 'Т. Шевченко',
          },
          {
            quote: 'Неможливо виростити повноцінну людину без виховання в ній почуття Прекрасного',
            author: 'Р. Тагор',
          },
          {
            quote: 'Із найбільш диких лошат виходять найкращі коні, аби тільки їх як слід виховати й виїздити',
            author: 'Плутарх',
          },
          {
            quote: 'Хто навчає і не виконує того, чого навчає, схожий на курку, яка, маючи крила, не літає',
            author: 'Східна мудрість',
          },
          {
            quote: 'Дитина, яка терпить менше образ, виростає людиною, яка більше усвідомлює свою гідність',
            author: 'М. Чернишевський',
          },
          {
            quote: 'Дітей не відлякаєш суворістю, вони не переносять тільки брехні',
            author: 'О. Толстой',
          },
          {
            quote: 'Чи не від того люди мордують дітей, а інколи й дорослих, що їх так важко виховувати, ' +
              'а шмагати так легко? Чи не помщаємося ми покаранням за нашу нездатність?',
            author: 'О. Герцен',
          },
          {
            quote: 'Ліниві завжди бувають людьми посередніми',
            author: 'Вольтер',
          },
          {
            quote: 'Нехай учитель поспішає до дітей, радіє кожній зустрічі з ними, ' +
              'тоді й діти поспішатимуть у школу і щиро радітимуть кожній зустрічі зі своїм учителем.',
            author: 'Ш. Амонашвілі',
          },
          {
            quote: 'Відкриття народжуються там, де закінчуються знання вчителя й починається нове знання учня.',
            author: 'К.Федін',
          },
          {
            quote: 'Ти можеш!» - повинен нагадувати вчитель учневі.\n' +
              '«Він може!» - повинен нагадувати колектив.\n' +
              '«Я можу!» - повинен повірити в себе учень.',
            author: 'В.Шаталов',
          },
          {
            quote: 'Якщо ти віднайдеш у своєму серці турботу про когось іншого, ти досягнеш успіху',
            author: 'Мая Ангелоу',
          },
          {
            quote: 'Творчість - це не розкіш для обраних, а загальна біологічна потреба, інколи не усвідомлена нами',
            author: 'Г. Іванов',
          },
          {
            quote: 'Найголовніша формула успіху - знання «як поводитися з людьми».',
            author: 'Т.Рузвельт',
          },
          {
            quote: 'Всередині нас криються потенційні творчі можливості, ' +
              'й ми повинні працювати щосили, щоб розкрити цей потенціал',
            author: 'Мартін Лютер Кінг',
          },
          {
            quote: 'Даруй себе дітям! Будь терплячим і будь готовим до зустрічі з ними в дитинстві.',
            author: 'Ш.Амонашвілі',
          },
          {
            quote: 'Ти чекав на цитату? Але тут лише я',
            author: 'Діо',
          }
        ]
      }
    },
    computed: {
      quoteIndexRandomizer() {
        return Math.floor(Math.random() * this.quotes.length);
      }
    },
    created() {
      this.randQuoteIndex = this.quoteIndexRandomizer
    }
  }
</script>
